{
  "</s>": 1,
  "<pad>": 0,
  "<unk>": 2,
  "▁<extra_id_55>": 250044,
  "▁<extra_id_56>": 250043,
  "▁<extra_id_57>": 250042,
  "▁<extra_id_58>": 250041,
  "▁<extra_id_59>": 250040,
  "▁<extra_id_60>": 250039,
  "▁<extra_id_61>": 250038,
  "▁<extra_id_62>": 250037,
  "▁<extra_id_63>": 250036,
  "▁<extra_id_64>": 250035,
  "▁<extra_id_65>": 250034,
  "▁<extra_id_66>": 250033,
  "▁<extra_id_67>": 250032,
  "▁<extra_id_68>": 250031,
  "▁<extra_id_69>": 250030,
  "▁<extra_id_70>": 250029,
  "▁<extra_id_71>": 250028,
  "▁<extra_id_72>": 250027,
  "▁<extra_id_73>": 250026,
  "▁<extra_id_74>": 250025,
  "▁<extra_id_75>": 250024,
  "▁<extra_id_76>": 250023,
  "▁<extra_id_77>": 250022,
  "▁<extra_id_78>": 250021,
  "▁<extra_id_79>": 250020,
  "▁<extra_id_80>": 250019,
  "▁<extra_id_81>": 250018,
  "▁<extra_id_82>": 250017,
  "▁<extra_id_83>": 250016,
  "▁<extra_id_84>": 250015,
  "▁<extra_id_85>": 250014,
  "▁<extra_id_86>": 250013,
  "▁<extra_id_87>": 250012,
  "▁<extra_id_88>": 250011,
  "▁<extra_id_89>": 250010,
  "▁<extra_id_90>": 250009,
  "▁<extra_id_91>": 250008,
  "▁<extra_id_92>": 250007,
  "▁<extra_id_93>": 250006,
  "▁<extra_id_94>": 250005,
  "▁<extra_id_95>": 250004,
  "▁<extra_id_96>": 250003,
  "▁<extra_id_97>": 250002,
  "▁<extra_id_98>": 250001,
  "▁<extra_id_99>": 250000
}
